; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		w a z r h d g l i u e - block
	)
	(:init
		(handempty)
		(clear e)
		(ontable e)
		(clear d)
		(on d u)
		(ontable u)
		(clear g)
		(on g l)
		(ontable l)
		(clear w)
		(on w a)
		(ontable a)
		(clear z)
		(on z r)
		(ontable r)
		(clear i)
		(on i h)
		(ontable h)		
	)
	(:goal (and
		;; wizard
		(clear w) (ontable d) (on w i) (on i z) (on z a) (on a r) (on r d)
	))
)

; plan
1. (unstack d u)
   deleted: (clear d) (handempty) (on d u)
   added: (holding d) (clear u)
   goals met: 1 of 7
2. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 2 of 7
3. (unstack z r)
   deleted: (clear z) (handempty) (on z r)
   added: (holding z) (clear r)
   goals met: 2 of 7
4. (put-down z)
   deleted: (holding z)
   added: (clear z) (handempty) (ontable z)
   goals met: 2 of 7
5. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 2 of 7
6. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 3 of 7
7. (unstack w a)
   deleted: (clear w) (handempty) (on w a)
   added: (holding w) (clear a)
   goals met: 2 of 7
8. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 3 of 7
9. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 3 of 7
10. (stack a r)
   deleted: (holding a) (clear r)
   added: (clear a) (handempty) (on a r)
   goals met: 4 of 7
11. (pick-up z)
   deleted: (ontable z) (clear z) (handempty)
   added: (holding z)
   goals met: 4 of 7
12. (stack z a)
   deleted: (holding z) (clear a)
   added: (clear z) (handempty) (on z a)
   goals met: 5 of 7
13. (unstack i h)
   deleted: (clear i) (handempty) (on i h)
   added: (holding i) (clear h)
   goals met: 5 of 7
14. (stack i z)
   deleted: (holding i) (clear z)
   added: (clear i) (handempty) (on i z)
   goals met: 6 of 7
15. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 5 of 7
16. (stack w i)
   deleted: (holding w) (clear i)
   added: (clear w) (handempty) (on w i)
   goals met: 7 of 7
